# РАБОТА С ДАННЫМИ PANDAS. DATASET ПО ПРОДАЖАМ

Kaggle — система организации конкурсов по исследованию данных, а также социальная сеть специалистов по обработке данных и машинному обучению.

In [3]:
import numpy as np 
import pandas as pd

In [5]:
ser = pd.Series(np.arange(4.), index=['red','blue','yellow','white'])

In [6]:
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [7]:
ser.drop('yellow')

red      0.0
blue     1.0
white    3.0
dtype: float64

Датасет по продажам

In [15]:
sales = pd.read_csv('sales_train.csv')

In [16]:
sales.head(10)  # просмотреть часть таблицы, default = 5

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0
5  10.01.2013               0       25     2564      349.00           1.0
6  02.01.2013               0       25     2565      549.00           1.0
7  04.01.2013               0       25     2572      239.00           1.0
8  11.01.2013               0       25     2572      299.00           1.0
9  03.01.2013               0       25     2573      299.00           3.0

In [17]:
sales.shape  # посмотреть размер dataset

(2935849, 6)

In [18]:
# конкретный магазин в конкретный день

sales59 = sales[sales.shop_id == 59]
sales59

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
0,02.01.2013,0,59,22154,999.0,1.0
40084,10.01.2013,0,59,22151,399.0,1.0
77502,04.01.2013,0,59,5603,699.0,1.0
77503,19.01.2013,0,59,5587,199.0,2.0
77504,31.01.2013,0,59,5613,5571.0,1.0
...,...,...,...,...,...,...
2899654,10.10.2015,33,59,4962,298.0,1.0
2899655,04.10.2015,33,59,4706,299.0,1.0
2899656,11.10.2015,33,59,5002,2999.0,1.0
2899657,15.10.2015,33,59,5233,1199.0,1.0
2899658,21.10.2015,33,59,5039,1499.0,1.0

In [19]:
sales59.date[0]

'02.01.2013'

In [20]:
type(sales59.date[0])

str

In [21]:
sales59.date[0].split('.')

['02', '01', '2013']

In [23]:
ts = pd.to_datetime(sales59.date[0])
ts

Timestamp('2013-02-01 00:00:00')

In [25]:
ts.day

1

In [26]:
ts.month

2

In [27]:
ts.year

2013

In [28]:
ts.hour

0

In [30]:
sales59.date = pd.to_datetime(sales59.date)  # перевод столбца date в формат datetime
sales59.set_index('date', inplace = True)  # установить эту колонку индексируюущей
sales59

C:\Users\esgre\AppData\Local\Temp\ipykernel_4040\1888169459.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales59.date = pd.to_datetime(sales59.date)  # перевод столбца date в формат datetime

            date_block_num  shop_id  item_id  item_price  item_cnt_day
date
2013-02-01               0       59    22154       999.0           1.0
2013-10-01               0       59    22151       399.0           1.0
2013-04-01               0       59     5603       699.0           1.0
2013-01-19               0       59     5587       199.0           2.0
2013-01-31               0       59     5613      5571.0           1.0
...                    ...      ...      ...         ...           ...
2015-10-10              33       59     4962       298.0           1.0
2015-04-10              33       59     4706       299.0           1.0
2015-11-10              33       59     5002      2999.0           1.0
2015-10-15              33       59     5233      1199.0           1.0
2015-10-21              33       59     5039      1499.0           1.0

[42108 rows x 5 columns]

In [31]:
sales59 = sales59.drop(columns = ['date_block_num', 'item_id'])  # избавиться от колонок date_block_num и item_id
sales59

            shop_id  item_price  item_cnt_day
date
2013-02-01       59       999.0           1.0
2013-10-01       59       399.0           1.0
2013-04-01       59       699.0           1.0
2013-01-19       59       199.0           2.0
2013-01-31       59      5571.0           1.0
...             ...         ...           ...
2015-10-10       59       298.0           1.0
2015-04-10       59       299.0           1.0
2015-11-10       59      2999.0           1.0
2015-10-15       59      1199.0           1.0
2015-10-21       59      1499.0           1.0

[42108 rows x 3 columns]

In [32]:
sales59['income'] = sales59['item_price']*sales59['item_cnt_day']
sales59

            shop_id  item_price  item_cnt_day  income
date
2013-02-01       59       999.0           1.0   999.0
2013-10-01       59       399.0           1.0   399.0
2013-04-01       59       699.0           1.0   699.0
2013-01-19       59       199.0           2.0   398.0
2013-01-31       59      5571.0           1.0  5571.0
...             ...         ...           ...     ...
2015-10-10       59       298.0           1.0   298.0
2015-04-10       59       299.0           1.0   299.0
2015-11-10       59      2999.0           1.0  2999.0
2015-10-15       59      1199.0           1.0  1199.0
2015-10-21       59      1499.0           1.0  1499.0

[42108 rows x 4 columns]

In [34]:
sales59_2013 = sales59[sales59.index.year == 2013]
sales59_2014 = sales59[sales59.index.year == 2014]
sales59_2015 = sales59[sales59.index.year == 2015]

In [35]:
# доход за 2013 год

sales59_2013.income.sum()

17386308.589999136

In [36]:
# доход за 2014 год

sales59_2014.income.sum()

17479125.7900001

In [37]:
# доход за 2015 год

sales59_2015.income.sum()  # доходность резко снизилась

10361144.519999841

In [38]:
# среднемесячный доход по годам

month_income_2013 = [sales59_2013[sales59_2013.index.month == i].income.sum() for i in range(1, 13)]
month_income_2014 = [sales59_2014[sales59_2014.index.month == i].income.sum() for i in range(1, 13)]
month_income_2015 = [sales59_2015[sales59_2015.index.month == i].income.sum() for i in range(1, 13)]

In [39]:
months = ['Jan', 'Feb', 'March', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

month_income_2013 = pd.Series(month_income_2013, index = months)
month_income_2014 = pd.Series(month_income_2014, index = months)
month_income_2015 = pd.Series(month_income_2015, index = months)

In [41]:
month_income_2013

Jan      1.330189e+06
Feb      1.485324e+06
March    1.494760e+06
Apr      9.827315e+05
May      1.088616e+06
Jun      1.263982e+06
Jul      1.232969e+06
Aug      1.296419e+06
Sep      1.655218e+06
Oct      1.352985e+06
Nov      1.908513e+06
Dec      2.294602e+06
dtype: float64

In [40]:
month_income_2013.mean()

1448859.0491665946

In [42]:
month_income_2014.mean()

1456593.8158333416

In [43]:
month_income_2015.mean()

863428.7099999866

In [45]:
# самый прибыльный месяц

best_2013 = month_income_2013.index[month_income_2013.argmax()]
best_2014 = month_income_2014.index[month_income_2014.argmax()]
best_2015 = month_income_2015.index[month_income_2015.argmax()]

In [46]:
best_2013

'Dec'

In [47]:
best_2014

'Dec'

In [48]:
best_2015

'Feb'

В чём причина?

In [49]:
sales59_2013.index.max()  # посмотреть макисмальную дату наблюдений за год

Timestamp('2013-12-31 00:00:00')

In [50]:
sales59_2014.index.max()

Timestamp('2014-12-31 00:00:00')

In [51]:
sales59_2015.index.max()

Timestamp('2015-12-10 00:00:00')

Выкенем декабрь из рассмотрения

In [ ]:
month_income_2013.iloc[:-1]

In [ ]:
month_income_2014.iloc[:-1]

In [ ]:
month_income_2015.iloc[:-1]

In [55]:
month_income_2013.iloc[:-1].mean()

1371973.3263635759

In [56]:
month_income_2014.iloc[:-1].mean()

1357972.9172727356

In [57]:
month_income_2015.iloc[:-1].mean()

921755.7745454401

In [ ]:
# 2015 был неудачным для данного магазина
# есть ли такая тенднеция среди других магазинов

sales31 = sales[sales.shop_id == 31]
sales31.date = pd.to_datetime(sales31.date)
sales31.set_index('date', inplace = True)
sales31 = sales31.drop(columns = ['date_block_num', 'item_id'])

In [59]:
sales31

            shop_id  item_price  item_cnt_day
date
2013-03-01       31      1794.0           2.0
2013-02-01       31      1789.0           1.0
2013-11-01       31       799.0           1.0
2013-01-26       31      1499.0           1.0
2013-01-25       31      1499.0           1.0
...             ...         ...           ...
2015-01-10       31      1999.0           1.0
2015-07-10       31      1999.0           1.0
2015-10-10       31      1999.0           1.0
2015-10-23       31      1199.0           1.0
2015-10-26       31       249.0           1.0

[235636 rows x 3 columns]

In [60]:
sales31['income'] = sales31['item_price']*sales31['item_cnt_day']
sales31_2013 = sales31[sales31.index.year == 2013]
sales31_2014 = sales31[sales31.index.year == 2014]
sales31_2015 = sales31[sales31.index.year == 2015]

In [61]:
month_income_31_2013 = [sales31_2013[sales31_2013.index.month == i].income.sum() for i in range(1, 13)]
month_income_31_2014 = [sales31_2014[sales31_2014.index.month == i].income.sum() for i in range(1, 13)]
month_income_31_2015 = [sales31_2015[sales31_2015.index.month == i].income.sum() for i in range(1, 13)]

In [62]:
month_income_31_2013 = pd.Series(month_income_31_2013, index = months)
month_income_31_2014 = pd.Series(month_income_31_2014, index = months)
month_income_31_2015 = pd.Series(month_income_31_2015, index = months)

In [63]:
sales31_2013.index.max()

Timestamp('2013-12-31 00:00:00')

In [64]:
sales31_2014.index.max()

Timestamp('2014-12-31 00:00:00')

In [65]:
sales31_2015.index.max()

Timestamp('2015-12-10 00:00:00')

In [66]:
# 10.12.2015 - закончился сбор данных по магазинам

month_income_31_2013.iloc[:-1].mean()

6779011.498182145

In [67]:
month_income_31_2014.iloc[:-1].mean()

6761601.265454522

In [68]:
month_income_31_2015.iloc[:-1].mean()

5157862.440908985

Вывод: как минимум у двух магазинов из перечня 2015 год оказался менее удачным, чем предшествующие.Возможно, это тенденция

# Очистка данных в Pandas

1. Обработка пропусков

In [69]:
DICT = {'Model':['Logistic Regression', 'SVM', 'KNN', 'Decision Tree'], 'Accuracy':[0.96, None, None, 0.67]}
df = pd.DataFrame(DICT)
df

                 Model  Accuracy
0  Logistic Regression      0.96
1                  SVM       NaN
2                  KNN       NaN
3        Decision Tree      0.67

In [70]:
df1 = df.fillna(0)  # заполнение NaN нулями 
df1

                 Model  Accuracy
0  Logistic Regression      0.96
1                  SVM      0.00
2                  KNN      0.00
3        Decision Tree      0.67

In [71]:
df2 = df.fillna(1)  # заполнение NaN единицами 
df2

                 Model  Accuracy
0  Logistic Regression      0.96
1                  SVM      1.00
2                  KNN      1.00
3        Decision Tree      0.67

In [72]:
df3 = df.fillna(df['Accuracy'].min())  # заполнение NaN минимальными значениями из таблицы
df3

                 Model  Accuracy
0  Logistic Regression      0.96
1                  SVM      0.67
2                  KNN      0.67
3        Decision Tree      0.67

In [73]:
df4 = df.dropna()  # выкинуть NaN
df4

                 Model  Accuracy
0  Logistic Regression      0.96
3        Decision Tree      0.67

In [74]:
df.fillna(method = 'bfill')  #  backfill заполнить ближайшим следующим значением, отличным от NaN

                 Model  Accuracy
0  Logistic Regression      0.96
1                  SVM      0.67
2                  KNN      0.67
3        Decision Tree      0.67

In [75]:
df.fillna(method = 'ffill')  # forefill - наоборот

                 Model  Accuracy
0  Logistic Regression      0.96
1                  SVM      0.96
2                  KNN      0.96
3        Decision Tree      0.67

2. Удаление дубликатов

In [77]:
DICT = {
    'Организация':
['Яндекс', 'Сбербанк', 'Мираторг', 'Яндекс', 'Mail.ru Group', 'Сбербанк', 'Яндекс'],
'Форма организации':
['ООО', 'ОАО', 'ООО', 'ООО', 'ООО', 'ПАО', 'ООО']}
df = pd.DataFrame(DICT)

In [78]:
df

     Организация Форма организации
0         Яндекс               ООО
1       Сбербанк               ОАО
2       Мираторг               ООО
3         Яндекс               ООО
4  Mail.ru Group               ООО
5       Сбербанк               ПАО
6         Яндекс               ООО

In [79]:
df.drop_duplicates()

     Организация Форма организации
0         Яндекс               ООО
1       Сбербанк               ОАО
2       Мираторг               ООО
4  Mail.ru Group               ООО
5       Сбербанк               ПАО

In [80]:
# в одном дубликате отличаются формы собственности

df.drop_duplicates(subset = 'Организация')  # удаление по колонке

     Организация Форма организации
0         Яндекс               ООО
1       Сбербанк               ОАО
2       Мираторг               ООО
4  Mail.ru Group               ООО

In [81]:
df.drop_duplicates(subset = 'Организация', keep = 'last')

     Организация Форма организации
2       Мираторг               ООО
4  Mail.ru Group               ООО
5       Сбербанк               ПАО
6         Яндекс               ООО